class ProductData {
  static final Map<String, List<String>> agriCategories = {
    "منتوجات فلاحية": [
      "الفواكه",
      "الخضروات ",
      "الحبوب ",
      "المحاصيل الزيتية ",
      "البقوليات ",
      "النباتات العطرية و الطبية ",
      "الأعلاف ",
    ],
    "معدات": [
      "الآلات الزراعية ",
      "المعدات الزراعية ",
      "معدات الري ",
      "معدات التسميد ",
    ],
    "أراضي": [],
  };

  static final Map<String, List<String>> agriSubCategories = {
    "الفواكه": [
      "تفاح ",
      "برتقال ",
      "موز ",
      "عنب ",
      "فراولة ",
      "مانجو ",
      "كمثرى ",
      "كرز ",
      "بطيخ ",
      "شمام ",
      "كيوي ",
      "أناناس ",
      "رمان ",
      "تين ",
      "تمر ",
    ],
    "الخضروات ": [
      "طماطم ",
      "جزر ",
      "بطاطا ",
      "فلفل ",
      "بصل ",
      "ثوم ",
      "خس ",
      "خيار ",
      "باذنجان ",
      "سبانخ",
      "ملفوف ",
      "فجل ",
      "شمندر ",
      "فاصوليا خضراء ",
      "كرفس ",
    ],
    "الحبوب ": [
      "قمح ",
      "شعير ",
      "ذرة ",
      "أرز ",
      "سورغم ",
      "شوفان ",
      "جاودار ",
      "دخن ",
      "كينوا ",
    ],
    "المحاصيل الزيتية ": [
      "زيتون ",
      "لوز ",
      "بندق ",
      "جوز ",
      "بذور عباد الشمس ",
      "بذور السمسم ",
      "بذور الكتان ",
      "بذور اللفت ",
      "فول سوداني ",
    ],
    "البقوليات ": [
      "عدس ",
      "حمص ",
      "فاصوليا بيضاء ",
      "فول ",
      "بازلاء مجففة ",
      "فاصوليا حمراء ",
      "فول الصويا ",
    ],
    "النباتات العطرية و الطبية ": [
      "نعناع ",
      "ريحان ",
      "زعتر ",
      "إكليل الجبل ",
      "بابونج ",
      "لافندر ",
      "مريمية ",
      "بقدونس ",
      "كزبرة ",
    ],
    "الأعلاف ": [
      "برسيم ",
      "تبن ",
      "نفل ",
      "سيلاج الذرة ",
      "سورغم العلفي ",
    ],
  };

  static final Map<String, List<String>> equipmentCategories = {
    "الآلات الزراعية ": ["جرار ", "حصادة ", "محراث "],
    "المعدات الزراعية ": [],
    "معدات الري ": ["أنابيب الري ", "رشاشات مياه "],
    "معدات التسميد ": [],
  };

  static final Map<String, List<String>> produitsElevages = {
    "الحيوانات الحية": [
      "أبقار حلوب",
      "أبقار للتسمين",
      "عجول",
      "أغنام (خراف، نعاج)",
      "ماعز (جديان، إناث ماعز)",
      "جمال",
      "خيول",
      "دواجن (دجاج، بط، ديك رومي)",
      "أرانب",
    ],
    "منتجات الألبان ومشتقاتها": [
      "الحليب الطازج (بقري، ماعز، غنم)",
      "الجبن (بلدي، موزاريلا، شيدر)",
      "الزبدة الطبيعية",
      "الياغورت الطبيعي",
      "القشطة",
      "اللبن الرائب",
    ],
    "المنتجات المشتقة من الحيوانات": [
      "الصوف الخام",
      "الجلود الطبيعية (بقر، غنم، ماعز)",
      "العسل الطبيعي",
      "شمع النحل",
      "البيض (بلدي، مزارع)",
      "السماد الطبيعي العضوي",
    ],
    "معدات وأدوات تربية المواشي": [
      "أقفاص وحظائر متنقلة",
      "معالف ومشارب أوتوماتيكية",
      "أجهزة الحلب اليدوية والكهربائية",
      "أدوات القص والتقليم (للحوافر والصوف)",
      "مستلزمات تدفئة الحظائر",
      "أنظمة تهوية وتحكم في الحرارة",
    ],
  };

  static final Map<String, Map<String, List<String>>> productTypeCategories = {
    "Agricol_Product": agriCategories,
    "Eleveur_Product": produitsElevages,
  };

  static final Map<String, Map<String, List<String>>> subCategoryDetails = {
    "Agricol_Product": {
      ...agriSubCategories,
      ...equipmentCategories,
    },
    "Eleveur_Product": {
      ...produitsElevages
    },
  };

   static final Map<String, List<String>> wilayas = {
  "01 - أدرار": [
    "أدرار", "أولف", "رڤانة", "تيميمون", "زاويت كنتة", "فنوغيل", "تسابيت", "تنركوك"
  ],
  "02 - الشلف": [
    "الشلف", "تنس", "أبو الحسن", "الكرمية", "أولاد فارس", "وادي فودا", "صوڤة", "بني حواء", "تاوغريت"
  ],
  "03 - الأغواط": [
    "الأغواط", "أفلو", "بريدة", "قصر الحيران", "حاسي الرمل", "عين مدحي", "وادي مره", "تجموت"
  ],
  "04 - أم البواقي": [
    "أم البواقي", "عين البيضاء", "عين ميلة", "فكرينة", "مسكنة", "سوق نعمان", "عين ببوش"
  ],
  "05 - باتنة": [
    "باتنة", "أريس", "باركة", "مروانة", "تكوت", "نقاوس", "المظهر", "عين توتة", "إشمول"
  ],
  "06 - بجاية": [
    "بجاية", "أكبو", "أميزور", "سيدي عيش", "تازمالت", "خراطة", "الكسور", "سوق الاثنين", "أديكار"
  ],
  "07 - بسكرة": [
    "بسكرة", "طولقة", "أورلال", "سيدي عقبة", "الكنطرة", "أم العيش", "ليشانة", "مشونة"
  ],
  "08 - بشار": [
    "بشار", "قنادسة", "تاغيت", "الحمار", "عبادلة", "بني عباس", "إيقيلي", "تمودي", "الواحة"
  ],
  "09 - البليدة": [
    "البليدة", "بوفريرك", "بنيان", "الأفرون", "موزاية", "البرعة", "وادي جر", "شبل"
  ],
  "10 - البويرة": [
    "البويرة", "لاكدارية", "سور الغزلان", "كادرية", "هايزر", "مشدالة", "عين بسم", "الهاشمية"
  ],
  "11 - تمنراست": [
    "تمنراست", "عبلاسة", "إن قزام", "إن صلاح", "تازروك", "تنزاوتين"
  ],
  "12 - تبسة": [
    "تبسة", "بئر العاتر", "شريا", "العيقلا", "نقرين", "أوهنزا", "العوينات"
  ],
  "13 - تلمسان": [
    "تلمسان", "غزوات", "مغنية", "نيدرومة", "رمشي", "سبدو", "بني سنوس", "بن سكرانة"
  ],
  "14 - تيارت": [
    "تيارت", "فرندة", "مهدية", "سوقور", "مدروس", "مشراصف", "قصر شلالة"
  ],
  "15 - تيزي وزو": [
    "تيزي وزو", "آزازغا", "درا ال ميزان", "البرعاث إيراثن", "بغني", "عين الحمام", "تيزي راشد"
  ],
  "16 - الجزائر العاصمة": [
    "الجزائر-وسط", "باب الواد", "الحراش", "بير مراد رايس", "حسين داي", "الرويبة", "دار البيضاء", "برتوتا"
  ],
  "17 - الجلفة": [
    "الجلفة", "عين وسرة", "حاسي بهبة", "مساعد", "شارف", "الادريسية", "زعفران"
  ],
  "18 - جيجل": [
    "جيجل", "المليا", "طاهر", "تكنا", "شلفة", "سيدي معروف", "العوانة"
  ],
  "19 - سيفت": [
    "سيفت", "الاولمة", "عين ولمان", "بوقاع", "بني أورطيلان", "حمام غورغور", "بابور"
  ],
  "20 - سعيدة": [
    "سعيدة", "عين الحجر", "أولاد براهيم", "سيدي بوبكر", "يوب"
  ],
  "21 - سكيكدة": [
    "سكيكدة", "كولو", "الحرّوش", "عزابة", "تمالوس", "بني بشير", "رمضان جمال"
  ],
  "22 - سيدي بلعباس": [
    "سيدي بلعباس", "تسالة", "بن باديس", "سفيصاف", "مصطفى بن ابراهيم", "راس الماء"
  ],
  "23 - عنابة": [
    "عنابة", "البوني", "الحجار", "برحال", "شطايبي", "سيرادي"
  ],
  "24 - قالمة": [
    "قالمة", "وادي زناتي", "بوشغوف", "حمام دباغ", "هيليوبوليس", "نشميا"
  ],
  "25 - قسنطينة": [
    "قسنطينة", "حمام بوزيان", "زيغود يوسف", "الخروب", "عين سمارة"
  ],
  "26 - المدية": [
    "المدية", "برواحية", "كصر البخاري", "تبلاط", "بني سليمان", "أم الجليل"
  ],
  "27 - مستغانم": [
    "مستغانم", "عين نويسي", "بوغراة", "خير الدين", "حاسي ميمش"
  ],
  "28 - المسيلة": [
    "المسيلة", "بوسعادة", "مجرة", "شلل", "أولاد دراج", "عين الحاجل"
  ],
  "29 - معسكر": [
    "معسكر", "سيغ", "تيغنيف", "وادي طاريا", "بوحنيفية"
  ],
  "30 - ورقلة": [
    "ورقلة", "توقورت", "الحجرة", "حاسي مسعود"
  ],
  "31 - وهران": [
    "وهران", "السنية", "أرزيو", "عين الترك", "بير الدجير", "بورتليس"
  ],
  "32 - البيض": [
    "البيض", "بوغتوب", "رڨاسة", "لابيوض سيد الشيخ"
  ],
  "33 - إليزي": [
    "إليزي", "دجانيت", "ديبدب"
  ],
  "34 - برج بوعريريج": [
    "برج بوعريريج", "الآشير", "مدجنة", "راس الوادي"
  ],
  "35 - بومرداس": [
    "بومرداس", "خميس الخشنة", "دلس", "نصرية"
  ],
  "36 - تيسمسيلت": [
    "تيسمسيلت", "برج بنعاما", "ثنية الحد"
  ],
  "37 - الوادي": [
    "الوادي", "رباح", "مياه أوينسا", "غمار"
  ],
  "38 - خنشلة": [
    "خنشلة", "الحمام", "قيس", "بابار"
  ],
  "39 - سوق أهراس": [
    "سوق أهراس", "سدرة", "تاورا", "درا"
  ],
  "40 - تيبازة": [
    "تيبازة", "شراشل", "جوريا", "حجوت"
  ],
  "41 - ميلة": [
    "ميلة", "جرام غوغا", "شلغوم العيد", "تلرغمة"
  ],
  "42 - عين الدفلى": [
    "عين الدفلى", "خميس مليانة", "مليانة", "العبادية"
  ],
  "43 - النعامة": [
    "النعامة", "مشريا", "عين سفرة", "تيت"
  ],
  "44 - عين تموشنت": [
    "عين تموشنت", "الملاح", "بني صاف", "حمام بوحدجار"
  ],
  "45 - غرداية": [
    "غرداية", "بريان", "متليلي", "المنيعة"
  ],
  "46 - غليزان": [
    "غليزان", "واد رحو", "مزاونة", "زمرورة"
  ],
  "47 - تندوف": [
    "تندوف", "الوزيرية", "بني جرادة", "الهامش"
  ],
  "48 - تلمسان": [
    "تلمسان", "الغزوات", "مغنية", "نيدرومة", "رمشي", "سبدو", "بني سنوس", "بن سكرانة"
  ],
};

  static List<String> getMainCategories(String? productType) {
    return productType != null
        ? productTypeCategories[productType]?.keys.toList() ?? []
        : [];
  }
  static List<String> getWilaya() {
    return wilayas.keys.toList();
  }

  static List<String> getSubCategories(String? productType, String? category) {
  if (productType != null && category != null) {
    return productTypeCategories[productType]?[category] ?? [];
  }
  return [];
}

 

static List<String> getFinalItems(String? productType, String? subCategory) {
  if (productType != null && subCategory != null) {
    return subCategoryDetails[productType]?[subCategory] ?? [];
  }
  return [];
}


}
